/**
 * 默认设置
 * 如需修改请按照readme文件要求填写在指定位置
 * 直接修改文件自动更新时会被重置
 */
const default_config = {
    model: '11',
    chatmodel: '01',
    maxday: '25',
    wait: '180000',
    minfollower: '5555',
    only_followed: '1',
    create_dy: '1',
    /* 与最新黑名单同步 */
    blacklist: '28008897,28272016,140389827,24598781,28008860,28008880,28008743,28008948,28009292,319696958,90138218,28272000,28272047,28271978,8831288,175979009,3177443,486780865,403048135,474325039,455274996,477519424,292671666,448873224,22498938,1770865,444796995,306112375,320193786,606637517,305276429,204487541,404761800,186914127,99439379,457697569,270886929,477519424,401575,201296348,206804212,333584926,34679178,699923691,392689522,178700744,272882445,350977368,487168411,22682842,444949061,523974463,192231907,503908324,383189098,252909207,336467750,264875137,90721742,452299642,677739290,441522918,8766623,698327474,5439672,483247863,237055308,95404163,202052696,1309889741,627942060,455030741,406353670,18036870,470220612',
    blockword: ["加群", "脚本", "代金券", "体验卡", "渲染券", "取关", "钓鱼", "脚本", "机器", "公众号", "扫二维码", "转发视频", "评论视频", "扫码", "问卷",
		"回答正确", "二维码", "扫一扫", "暗号", "书", "明信片", "学习资料", "读", "恭喜@", "恭喜以下", "恭喜一下", "投票", "签名", "资料", "小说", "中奖者@", "漫画",
		"记事本", "钥匙扣", "立牌", "小游戏", "相册", "照片", "写真", "出版", "一本", "弹幕", "英语", "物理", "嘴巴", "外挂", "程序", "开奖啦", "已私信"
	],
    followWhiteList: '',
    relay: ['[OK]', '[星星眼]', '[歪嘴]', '[喜欢]', '[偷笑]', '[笑]', '[喜极而泣]', '[辣眼睛]', '[吃瓜]', '[奋斗]', '永不缺席 永不中奖 永不放弃！',
		'万一呢', '在', '冲吖~', '来了', '万一', '[保佑][保佑]', '从未中，从未停', '[吃瓜]', '[抠鼻][抠鼻]', '来力', '秋梨膏', '[呲牙]', '从不缺席',
		'分子', '可以', '恰', '不会吧', '1', '好', 'rush', '来来来', 'ok', '冲', '凑热闹', '我要', '我要[打call]', '我还能中！', '让我中！！！', '大家',
		'都散了吧', '已经抽完了', '是我的', '我是天选之子', '给我中一次吧！', '坚持不懈，迎难而上，开拓创新！', '[OK][OK]', '我来抽个奖', '中中中中中中',
		'[doge][doge][doge]', '我我我', '转发动态', '抓鸭子', '呕吼', 'nice', '2333', '啊啊啊', '嘻嘻', '开心', '美好的一天', '我来看看', '....', '看看.',
		'额.', '好.', '哈哈', '(ô‿ô)', '≧◉◡◉≦', '≧◔◡◔≦', '(¬‿¬)', '≧◠◡◠≦✌', '(>‿◠)', '✌', '>_<||| ', '很尴尬~!!!', '→_→ 怀疑的眼神',
		'~~', '(*>﹏<*)′ 好刺激..',
		'（*^〔^*〕 羞羞', '嘿～ ', ' 当然！', '期待状', '可恶…', '(手扠腰) ', '好冷喔～ ', '呼噜呼', '噜', '……', 'GO ', '(拿彩球) ', '我疯了…', '阿达～ ',
		'连发飞拳！ ',
		'我放弃…', '真尴尬…', 'Oh！My God', '那我就评价一个[doge]', '[牛年]', '[2021]', '[福到了]', '[doge]', '[微笑]', '[OK]', '[星星眼]', '[妙啊]',
		'[辣眼睛]', '[吃瓜]',
		'[嗑瓜子]', '[滑稽]', '[笑哭]', '[呲牙]', '[打call]', '[脱单doge]', '[歪嘴]', '[给心心]', '[嘟嘟]', '[嫌弃]', '[喜欢]', '[哦呼]', '[酸了]',
		'[大哭]', '[害羞]', '[疑惑]',
		'[调皮]', '[喜极而泣]', '[奸笑]', '[笑]', '[偷笑]', '[惊讶]', '[捂脸]', '[阴险]', '[囧]', '[呆]', '[抠鼻]', '[大笑]', '[惊喜]', '[无语]',
		'[点赞]', '[鼓掌]', '[尴尬]',
		'[灵魂出窍]', '[委屈]', '[傲娇]', '[冷]', '[疼]', '[吓]', '[生病]', '[吐]', '[捂眼]', '[嘘声]', '[思考]', '[再见]', '[翻白眼]', '[哈欠]',
		'[奋斗]', '[墨镜]', '[难过]',
		'[撇嘴]', '[抓狂]', '[生气]', '[口罩]', '[鸡腿]', '[月饼]', '[雪花]', '[视频卫星]', '[11周年]', '[干杯]', '[爱心]', '[锦鲤]', '[胜利]', '[加油]',
		'[抱拳]', '[响指]',
		'[保佑]', '[支持]', '[拥抱]', '[跪了]', '[怪我咯]', '[黑洞]', '[老鼠]', '[凛冬-生气]', '[W-哈哈]', '[霜叶-疑问]', '[煌-震撼]', '[哭泣]', '[哈哈]',
		'[狗子]', '[羞羞]',
		'[亲亲]', '[耍帅]', '[气愤]', '[高兴]'
	],
    chat: [
		'[OK]', '[星星眼]', '[歪嘴]', '[喜欢]', '[偷笑]', '[笑]', '[喜极而泣]', '[辣眼睛]', '[吃瓜]', '[奋斗]', '永不缺席 永不中奖 永不放弃！',
		'万一呢', '在', '冲吖~', '来了', '万一', '[保佑][保佑]', '从未中，从未停', '[吃瓜]', '[抠鼻][抠鼻]', '来力', '秋梨膏', '[呲牙]', '从不缺席',
		'分子', '可以', '恰', '不会吧', '1', '好', 'rush', '来来来', 'ok', '冲', '凑热闹', '我要', '我要[打call]', '我还能中！', '让我中！！！', '大家',
		'都散了吧', '已经抽完了', '是我的', '我是天选之子', '给我中一次吧！', '坚持不懈，迎难而上，开拓创新！', '[OK][OK]', '我来抽个奖', '中中中中中中',
		'[doge][doge][doge]', '我我我', '转发动态', '抓鸭子', '呕吼', 'nice', '2333', '啊啊啊', '嘻嘻', '开心', '美好的一天', '我来看看', '....', '看看.',
		'额.', '好.', '哈哈', '(ô‿ô)', '≧◉◡◉≦', '≧◔◡◔≦', '(¬‿¬)', '≧◠◡◠≦✌', '(>‿◠)', '✌', '>_<||| ', '很尴尬~!!!', '→_→ 怀疑的眼神',
		'~~', '(*>﹏<*)′ 好刺激..',
		'（*^〔^*〕 羞羞', '嘿～ ', ' 当然！', '期待状', '可恶…', '(手扠腰) ', '好冷喔～ ', '呼噜呼', '噜', '……', 'GO ', '(拿彩球) ', '我疯了…', '阿达～ ',
		'连发飞拳！ ',
		'我放弃…', '真尴尬…', 'Oh！My God', '那我就评价一个[doge]', '[牛年]', '[2021]', '[福到了]', '[doge]', '[微笑]', '[OK]', '[星星眼]', '[妙啊]',
		'[辣眼睛]', '[吃瓜]',
		'[嗑瓜子]', '[滑稽]', '[笑哭]', '[呲牙]', '[打call]', '[脱单doge]', '[歪嘴]', '[给心心]', '[嘟嘟]', '[嫌弃]', '[喜欢]', '[哦呼]', '[酸了]',
		'[大哭]', '[害羞]', '[疑惑]',
		'[调皮]', '[喜极而泣]', '[奸笑]', '[笑]', '[偷笑]', '[惊讶]', '[捂脸]', '[阴险]', '[囧]', '[呆]', '[抠鼻]', '[大笑]', '[惊喜]', '[无语]',
		'[点赞]', '[鼓掌]', '[尴尬]',
		'[灵魂出窍]', '[委屈]', '[傲娇]', '[冷]', '[疼]', '[吓]', '[生病]', '[吐]', '[捂眼]', '[嘘声]', '[思考]', '[再见]', '[翻白眼]', '[哈欠]',
		'[奋斗]', '[墨镜]', '[难过]',
		'[撇嘴]', '[抓狂]', '[生气]', '[口罩]', '[鸡腿]', '[月饼]', '[雪花]', '[视频卫星]', '[11周年]', '[干杯]', '[爱心]', '[锦鲤]', '[胜利]', '[加油]',
		'[抱拳]', '[响指]',
		'[保佑]', '[支持]', '[拥抱]', '[跪了]', '[怪我咯]', '[黑洞]', '[老鼠]', '[凛冬-生气]', '[W-哈哈]', '[霜叶-疑问]', '[煌-震撼]', '[哭泣]', '[哈哈]',
		'[狗子]', '[羞羞]',
		'[亲亲]', '[耍帅]', '[气愤]', '[高兴]'
	],
};
/**
 * 自己修改过的设置
 */
const my_config = (() => {
    try {
        return JSON.parse(process.env.MY_CONFIG);
    } catch (_) {
        return {};
    }
})();

const config = {
    ...default_config,
    ...my_config
};

module.exports = config;
